Catalogs/Терминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Терминалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDТерминала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомерТермин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СистиемаМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дубликат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВажнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эксплуатация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СимКартаТермин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СИМКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальныйСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФискальныеСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>Помечается в случае, если договор составлен в "письменном виде".</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВСистеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Невидимоеполе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заметки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаметкиТермин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаметки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДвижениеТерминалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеТерминалов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Откуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Куда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Эксплуатация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорАрендРегистр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДвижениеОсновныхДеталей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеОсновныхДеталей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДетали</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СервисТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьРемонтаОД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Деталь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Используется.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>Используется</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоРасх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсполнительРасхИсп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРасхИсп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДетальРасх</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комплектующие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТерминалРасх</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Терминалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/РегистрОплатаАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>РегистрОплатаАренды</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьАрендыРег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроплаченныйМесяц</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаАрендыРег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегОпл</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РайонРег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РайоныУстановкиТерминалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДействующиеДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ДействующиеДоговора</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ФормаДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ФормаДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УстнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПисьменнаяФорма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Терминалы/Forms/ФормаЭлемента2/Ext/Form/Module.bsl
#Область ПроцедурыФормы

	//от здесь
	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		ТекущаяМетка = ПолучитьМетку(Объект.Ссылка);
		Организация = ПолучитьДанныеСРегистра(Объект.Ссылка).Организация;
		Договор = ПолучитьДанныеСРегистра(Объект.Ссылка).ДоговорАрендРегистр;
		ДатаПослОпл = ПолучитьДанныеОбОплАренд(Договор).ДатаРегОпл;
		ФД = ПолучитьФормуДоговора(Договор);
		ЭКС = ПолучитьПроведенныйДоговор();
		Если ФД  = ПолучитьПеречислениеФормыДоговораПисьменный() тогда
			НаРуках = истина;
		иначе 
			НаРуках = Ложь;
		КонецЕсли;
		
		Если не ЭКС = ""  тогда
			Объект.Эксплуатация = истина;
		Иначе 
			Объект.Эксплуатация = ложь;
		КонецЕсли;
		КонецПроцедуры

#КонецОбласти

#Область КомандыКнопок

	//Отбор для вывода Истории терминалов
	&НаКлиенте
	Процедура Команда2(Команда)
		ЗначОтб = Новый Структура("Терминал",Объект.Ссылка);
		ПарамВыбор = Новый Структура("Отбор",ЗначОтб);
		ОткрытьФорму("РегистрСведений.ДвижениеТерминалов.Форма.ФормаСписка",ПарамВыбор);
	КонецПроцедуры

	&НаКлиенте
	Процедура КомплектующиеНаТермин(Команда)
		ЗначОтб = Новый Структура("Терминал",Объект.Ссылка);
		ПарамВыбор = Новый Структура("Отбор",ЗначОтб);
		ОткрытьФорму("РегистрСведений.ДвижениеОсновныхДеталей.Форма.ФормаДляТерминалов",ПарамВыбор);
	КонецПроцедуры

	&НаКлиенте
	Процедура РасходныеНаТерминал(Команда)
		ЗначОтб = Новый Структура("ТерминалРасх",Объект.Ссылка);
		ПарамВыбор = Новый Структура("Отбор",ЗначОтб);
		ОткрытьФорму("РегистрНакопления.Используется.Форма.ФормаДляТерминала",ПарамВыбор);
	КонецПроцедуры

#КонецОбласти

#Область НужноПеренести

	&НаСервере
	Функция СрезПоследнихДанныхПоТерминалу(Терминал)
		Отбор = Новый Структура;
		Отбор.Вставить("Терминал", Терминал);
		Данные = РегистрыСведений.ДвижениеТерминалов.ПолучитьПоследнее(ТекущаяДата(),Отбор);
		Возврат Данные;
	КонецФункции

	&НаСервере
	Функция ПолучитьДанныеСРегистра(Терминал);
		Возврат СрезПоследнихДанныхПоТерминалу(Терминал);
	КонецФункции

	&НаСервере
	Функция СрезПоследнихДанныхПоОплАренд(Договор)
		Отбор = Новый Структура;
		Отбор.Вставить("Договор", Договор);
		Данные = РегистрыСведений.РегистрОплатаАренды.ПолучитьПоследнее(ТекущаяДата(),Отбор);
		Возврат Данные;
	КонецФункции

	&НаСервере
	Функция ПолучитьДанныеОбОплАренд(Договор);
		Возврат СрезПоследнихДанныхПоОплАренд(Договор);
	КонецФункции

	//Получаем группу договоров
	&НаСервере
	Функция ПолучитьГруппуДоговор(Договор,ОтноситсяКГруппе)
		возврат СрезПоследнихПолучитьДогорГруппа(Договор,ОтноситсяКГруппе);
	КонецФункции

	&НаСервере
	Функция ПолучитьМетку(Терминал)
		Данные = СрезПоследнихДанныхПоТерминалу(Терминал);
		Возврат Данные.Метка;
	КонецФункции

	//ПолучитьГруппуДоговора
	&НаСервере
	Функция СрезПоследнихПолучитьДогорГруппа(Договор,ОтноситсяКГруппе)
		Отбор = Новый Структура;
		Отбор.Вставить("Договор", Договор);
		Данные = РегистрыСведений.ДействующиеДоговора.ПолучитьПоследнее(ТекущаяДата(),Отбор);
		Возврат Данные.ОтноситсяКГрупе;

	КонецФункции

	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если Объект.Наименование = "" тогда
		Элементы.Кнопка1.Видимость = Ложь;
		Элементы.КомплектующиеНаТермин.Видимость = Ложь;
		Элементы.Группа4.Видимость = Ложь;
		Элементы.КомплектующиеНаТермин.Видимость = Ложь;
	КонецЕсли;
	
	ФД = ПолучитьФормуДоговора(Договор);
		ЭКС = ПолучитьПроведенныйДоговор();
		Если ФД  = ПолучитьПеречислениеФормыДоговораПисьменный() тогда
			НаРуках = истина;
		иначе 
			НаРуках = Ложь;
		КонецЕсли;
		
		Если не ЭКС = ""  тогда
			Объект.Эксплуатация = истина;
		Иначе 
			Объект.Эксплуатация = ложь;
		КонецЕсли;

	КонецПроцедуры

	&НаСервереБезКонтекста
	Процедура ПослеЗаписиНаСервере(Терминал, Метка)
		//НДП = Документы.ПеремещениеТерминалов.СоздатьДокумент();
		//НДП.Дата = ТекущаяДата();
		//НДП.ПеремКуда = Терминал.Наименование;
		//НДП.НоваяМетка = Метка;
		//НДП.Записать("Posting");
	КонецПроцедуры

	//Получаю перечисление
	&НаСервере
	Функция ПолучитьПеречислениеФормыДоговораПисьменный()
		Возврат Перечисления.ФормаДоговора.ПисьменнаяФорма;
	КонецФункции

	//Обращаюсь к регистру Сведения о Договорах 
	&НаСервере
	функция ПолучитьФормуДоговора(Договор)
		Возврат Договор.ФормаДоговора;	
	КонецФункции
	
	&НаСервере
	функция ПолучитьПроведенныйДоговор()
		//Возврат Ввод.Метка;
		Возврат ТекущаяМетка.Наименование;	
	КонецФункции


#КонецОбласти
